УчетВУправляющихДляГит1/src/Catalogs/ВидыДеятельностиЕНВД/ВидыДеятельностиЕНВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельностиЕНВД</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>КодВидаДеятельности</name>
    <type>
      <types>CatalogRef.КлассификаторВидовПредпринимательскойДеятельностиЕНВД</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/ВидыУведомленийОСпецрежимахНалогообложения/ВидыУведомленийОСпецрежимахНалогообложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомленийОСпецрежимахНалогообложения</name>
  <enumValues>
    <name>УведомлениеОПереходеНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУтратеПраваНаУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОтказеОтУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииОбъектаНалогообложенияПоУСН</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПрекращенииДеятельностиПоУСН</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатента</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеПатентаРекомендованнаяФорма</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОбУтратеПраваНаПатент</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПрекращенииДеятельностиПоПатентнойСистеме</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД1</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД2</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД3</name>
  </enumValues>
  <enumValues>
    <name>ФормаЕНВД4</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_1</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_3_2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_4</name>
  </enumValues>
  <enumValues>
    <name>Форма_1_6_Учет</name>
  </enumValues>
  <enumValues>
    <name>ФормаУ_ИО</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС1</name>
  </enumValues>
  <enumValues>
    <name>ФормаТС2</name>
  </enumValues>
  <enumValues>
    <name>ФормаС09_6</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеИсключенииПроверки</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеПостановкаОбъектаНВОС</name>
  </enumValues>
  <enumValues>
    <name>ФормаР21001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР24001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР11001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР13001</name>
  </enumValues>
  <enumValues>
    <name>ФормаР14001</name>
  </enumValues>
  <enumValues>
    <name>ФормаКИК</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОНаделенииОППолномочиямиПоВыплатам</name>
  </enumValues>
  <enumValues>
    <name>ФормаСИО</name>
  </enumValues>
  <enumValues>
    <name>НевозможностьПредоставленияДокументов</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОВозвратеНалога</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОЗачетеНалога</name>
  </enumValues>
  <enumValues>
    <name>ДекларацияОХарактеристикахОбъектаНедвижимости</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПредоставленииРассрочкиФСС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОПримененииНалоговойЛьготыУчастникамиРегиональныхИнвестиционныхПроектов</name>
  </enumValues>
  <enumValues>
    <name>ПостановкаСнятиеВКачествеНалоговогоАгента</name>
  </enumValues>
  <enumValues>
    <name>СогласиеНаРаскрытиеНалоговойТайны</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУчастникаСколково</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНаПолучениеДокументаНалоговогоРезидента</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеУменьшениеНалогаККТ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеОсвобождениеОтСтраховыхВзносов</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбОткрытииЗакрытииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбИзмененииРеквизитовСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОНаличииСчета</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПорядокПредставленияНалоговыхДеклараций</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеРанееПредставленныеДокументы</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>ЗаявлениеНДДДУС</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеКЛМК</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПрекращениеЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтНДСПриЕСХН</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеРегиональныхНалогов</name>
  </enumValues>
  <enumValues>
    <name>ОсвобождениеОтУплатыНДС</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/ВидыДеятельностиЕНВД/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ОтборВладелец;
	
	ИспользуетсяНесколькоОрганизаций = Справочники.Организации.ИспользуетсяНесколькоОрганизаций();
	
	Если ИспользуетсяНесколькоОрганизаций Тогда
		
		УстановленОтборПоВладельцу = Параметры.Отбор.Свойство("Владелец", ОтборВладелец);
		
		Если УстановленОтборПоВладельцу Тогда
			ОтборОрганизация = ОтборВладелец;
		Иначе
			ОтборОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
			ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
				Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
				"Владелец",
				ОтборОрганизация,
				,
				,
				ОтборОрганизацияИспользование);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Владелец.Видимость = Не УстановленОтборПоВладельцу И ИспользуетсяНесколькоОрганизаций;
	Элементы.ГруппаОтборОрганизация.Видимость  = Не УстановленОтборПоВладельцу И ИспользуетсяНесколькоОрганизаций;
	Элементы.ОтборОрганизацияНадпись.Видимость = УстановленОтборПоВладельцу И ИспользуетсяНесколькоОрганизаций;
	
	ВестиУчетЮридическогоЛица = ПолучитьФункциональнуюОпцию("ВестиУчетЮридическогоЛица");
	ВестиУчетИндивидуальногоПредпринимателя = ПолучитьФункциональнуюОпцию("ВестиУчетИндивидуальногоПредпринимателя");
	
	ФормыЗавленияОПостановкеНаУчет = Новый Массив;
	ФормыЗавленияОСнятииСУчета     = Новый Массив;
	
	Если ВестиУчетЮридическогоЛица Тогда
		ФормыЗавленияОПостановкеНаУчет.Добавить("ЕНВД-1");
		ФормыЗавленияОСнятииСУчета.Добавить("ЕНВД-3");
	КонецЕсли;
	
	Если ВестиУчетИндивидуальногоПредпринимателя Тогда
		ФормыЗавленияОПостановкеНаУчет.Добавить("ЕНВД-2");
		ФормыЗавленияОСнятииСУчета.Добавить("ЕНВД-4");
	КонецЕсли;
	
	Элементы.ФормаПостановкаНаУчет.Заголовок =
		СтрШаблон("%1 (%2)",
		НСтр("ru = 'Постановка на учет'"),
		СтрСоединить(ФормыЗавленияОПостановкеНаУчет, ", "));
	
	Элементы.ФормаСнятиеСУчета.Заголовок =
		СтрШаблон("%1 (%2)",
		НСтр("ru = 'Снятие с учета'"),
		СтрСоединить(ФормыЗавленияОСнятииСУчета, ", "));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" И Не УстановленОтборПоВладельцу Тогда
		
		ОтборОрганизация = Параметр;
		ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
			"Владелец",
			ОтборОрганизация,
			,
			,
			ОтборОрганизацияИспользование);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"Владелец",
		ОтборОрганизация,
		,
		,
		ОтборОрганизацияИспользование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		ОтборОрганизацияИспользование = Истина;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор,
		"Владелец",
		ОтборОрганизация,
		,
		,
		ОтборОрганизацияИспользование);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПостановкаНаУчет(Команда)
	
	ВидыЗаявлений = Новый Соответствие;
	Если ВестиУчетЮридическогоЛица Тогда
		ЭтоЮрЛицо = Истина;
		ВидыЗаявлений.Вставить(ЭтоЮрЛицо, ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД1"));
	КонецЕсли;
	Если ВестиУчетИндивидуальногоПредпринимателя Тогда
		ЭтоЮрЛицо = Ложь;
		ВидыЗаявлений.Вставить(ЭтоЮрЛицо, ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД2"));
	КонецЕсли;
	
	СоздатьЗаявления(ВидыЗаявлений);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятиеСУчета(Команда)
	
	ВидыЗаявлений = Новый Соответствие;
	Если ВестиУчетЮридическогоЛица Тогда
		ЭтоЮрЛицо = Истина;
		ВидыЗаявлений.Вставить(ЭтоЮрЛицо, ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД3"));
	КонецЕсли;
	Если ВестиУчетИндивидуальногоПредпринимателя Тогда
		ЭтоЮрЛицо = Ложь;
		ВидыЗаявлений.Вставить(ЭтоЮрЛицо, ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаЕНВД4"));
	КонецЕсли;
	
	СоздатьЗаявления(ВидыЗаявлений);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьЗаявления(ВидыЗаявлений)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	МассивРегистраций = Новый Массив;
	УникальныеЗначенияРегистраций = Новый Соответствие;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		
		РегистрацияВНалоговомОргане = ТекущиеДанные.РегистрацияВНалоговомОргане;
		Если УникальныеЗначенияРегистраций[РегистрацияВНалоговомОргане] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивРегистраций.Добавить(РегистрацияВНалоговомОргане);
		УникальныеЗначенияРегистраций.Вставить(РегистрацияВНалоговомОргане, Истина);
		
	КонецЦикла;
	
	Для Каждого РегистрацияВНалоговомОргане Из МассивРегистраций Цикл
		
		МассивВидовДеятельности = Новый Массив;
		Организация = Неопределено;
		Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
			
			ТекущиеДанные = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
			Если ТекущиеДанные.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане Тогда
				Если Организация = Неопределено Или Организация = ТекущиеДанные.Владелец Тогда
					МассивВидовДеятельности.Добавить(ТекущиеДанные.Ссылка);
					Организация = ТекущиеДанные.Владелец;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивВидовДеятельности.Количество() <> 0 Тогда
			
			ВидЗаявления = ВидыЗаявлений.Получить(ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(Организация));
			Если ВидЗаявления = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОткрытьФормуЗаявления(ВидЗаявления, Организация, РегистрацияВНалоговомОргане, МассивВидовДеятельности);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаявления(ВидЗаявления, Организация, РегистрацияВНалоговомОргане, ВидыДеятельности)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ВидыДеятельности", ВидыДеятельности);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("НалоговыйОрган", РегистрацияВНалоговомОргане);
	ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
	ПараметрыФормы.Вставить("СформироватьФормуОтчетаАвтоматически", Истина);
	
	УчетЕНВДКлиент.ОткрытьФормуЗаявления(ВидЗаявления, ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
